#T15_31
#Твередженння про стан програми assert


def swiftpow(x, n):
    '''"Швидке" обчислення натуральної степені дійсного числа.

    Використовується інваріантне твердження z*t**k == x**n
    '''
    k = n
    z = 1
    t = x
    while k > 0:
        if k % 2 == 0:  #якщо k парне
            t = t*t     #підносимо t до квадрату
            k = k // 2  #k ділимо на 2
        else:           #якщо k непарне
            z = z*t     #z домножуємо на t
            k = k - 1   #від k віднімаємо 1
    #перевіряємо твердження, що z == x ** n
    #якщо не так, то буде ініційована помилка та виведено повідомлення
    assert z == x ** n, str(z) + ', ' + str(x**n)
    return z

x = float(input('Число: '))
n = int(input('Степінь: '))

y = swiftpow(x, n)
print('y = ', y)
