#T15_22_v2
#Тестування генерації виключень для черги з обробкою виключення
#та записом у журнал

import random, logging
from t15_21_queue import *

LOGFILENAME = 'queue.log'               #ім'я файлу журналу
FORMAT = '%(asctime) -15s %(message)s'  #формат запису: <час> <повідомлення>
logging.basicConfig(filename = LOGFILENAME, format=FORMAT, level = logging.DEBUG)

def testqueue():
    '''Функція проводить випробування додавання та взяття елементів черги.

    Для випробувань використовується генератор випадкових чисел, який повертає
    значення 0 або 1
    Якщо повернуто 0, то елемент береться з початку черги.
    Якщо  повернуто 1, то новий елемент додається до черги.
    '''
    q = Queue()
    n = int(input('Кількість елементів у черзі: '))
    m = int(input('Кількість випробувань: '))

    k = 0
    #спочатку до черги додається n елементів
    for i in range(n):
        k = k+1
        q.add(k)
    #Далі проводиться m випробувань з обробкою виключення взяття з порожньої черги
    try:
        for i in range(m):
            d = random.randrange(2) #d може бути 1 або 0
            if d == 0:              #узяти елемент з черги
                j = q.take()        #У цьому місці може виникнути помилка, якщо черга порожня
                print('Взято з черги ', j)
            else:                   #додати елемент до черги
                k = k+1
                q.add(k)
                print('Додано до черги ', k)
    except QueueEmptyError as e:
    #показуємо повідомлення про помилку та записуємо її у журнал
        print('Помилка!', e)
        logging.error(e)
        
    print('Залишок черги')
    while not q.isempty():
        j = q.take()
        print(j)

testqueue()
