#T15_01_v2
#Видалення елемента списку. Обробка помилок. Вкладені блоки try except

n = int(input('Кількість елементів: '))

#введення списку
x = []
for i in range(n):
    k = int(input('Елемент ' + str(i+1) + ': '))
    x.append(k)


#видалення 1 елемента списку
while True:
    try:
        m = int(input('Елемент для видалення: ')) #винесено перед блоком try...
        try:
            x.remove(m)                           #видалення m зі списку
            print(m, ' видалено')
            break
        except ValueError:
#except буде виконано, якщо станеться помилка ValueError під час видалення зі списку
            print ('Елемента немає у списку. Введіть інший')
    except ValueError:
#except буде виконано, якщо станеться помилка ValueError під час введення даних
        print ('Неправильно введено значення елемента для видалення. Повинно бути ціле число')

print('Список ', x)
