#T08_01_v2
#Визначити кількість входжень кожного слова до рядка
#та слово, яке входить найбільшу кількість разів
#Використовується словникоутворення

s = input("введіть рядок: ")

x = s.split()   #x - список слів рядка
#d - словник з ключами - словами
#та зі значеннями - кількостями входжень слів у список x
#if x.index(w) == i дозволяє уникнути повторів
d = {w:x.count(w) for i,w in enumerate(x) if x.index(w) == i}

print('слова та кількість входжень',d)

#"перевертаємо" словник d, роблячи ключами - кількість входжень, а значеннями - слова
upd = {n: x for n, x in zip(d.values(), d.keys())}
#у словнику upd з декільькох слів з однаковою кількістю входжень буде вибрано тільки одне
#але для нашої задачі це несуттєво

#max(upd) повертає найбільший ключ, тобто, найбільшу кількість входжень
print('слово, яке входить найчастіше -', upd[max(upd)])
