#T08_11_v1
#Перевіряє, чи є розріджена квадратна матриця симетричною

n = int(input("розмір матриці: "))
m = int(input("кількість ненульових елементів: "))

#введення матриці
a = {}  #a - словник, що зберігає ненульові елементи розрідженої матриці
for i in range(m):
    r = int(input('рядок:'))
    c = int(input('стовпчик:'))
    #ключами у словнику a будуть кортежі (r,c)
    a[(r,c)] = float(input('значення:'))

#виведення матриці, якщо вона вміщується на екрані (приблизно :) )
MAX_SIZE = 20
if n <= MAX_SIZE:
    for i in range(n):
        row = [0]*n   #заповнюємо i-ий рядок нулями для виведення на екран  
        for r, c in a.keys():   #перебираємо всі елементи матриці
            if r-1 == i:        #та вибираємо ті, які розміщуються у i-му рядку
                row[c-1] = a[(r,c)]    #змінюємо елементи, які є у словнику 
        print(row)

  
#перевірка на симетричність
is_symm = True          #is_symm сигналізує про те, чи є матриця симетричною
for r, c in a.keys():
    if a[(r,c)] != a.get((c,r)): #a.get((c,r)) повертає 0, якщо елемента
                                 #немає у словнику, a[(c,r)] дає помилку
        is_symm = False
        break

if is_symm:
    print('матриця є симетричною')
else:
    print('матриця не є симетричною')

