#T08_01_v1
#Визначити кількість входжень кожного слова до рядка
#та слово, яке входить найбільшу кількість разів

s = input("введіть рядок: ")

x = s.split()   #x - список слів рядка
d = {}          #d - словник з ключами - словами
                #та зі значеннями - кількостями входжень слів у список x
for w in x:
    if w not in d:
        d[w] = x.count(w)

print('слова та кількість входжень',d)

#основний варіант
m = 0       #m - максимальна кількість входжень
mw = ''     #mw - слово, яке входить найбільшу кількість раз
for w,k in d.items():
    if k > m:
        m = k
        mw = w
print('слово, яке входить найчастіше -',mw)


#альтернативний варіант
v = list(d.values())    #v - список кількостей входжень слів
i = v.index(max(v))     #i - індекс максимального елемента v
wd = list(d.keys())     #wd - список слів     
print('слово, яке входить найчастіше -',wd[i])




