#T09s1_21
#Визначення символа, який входить у рядок найбільшу кількість разів, а також кількості входжень

def max_char (s):
    '''Визначає символ, який входить у рядок s найбільшу кількість разів, а також кількість входжень.

    '''
    mx = 0          #mx - максимальна кількість входжень
    mc = chr(0)     #mc - символ, що входить максимальну кількість разів
    if len(s) > 0:
#обчислюємо максимум списку кортежів з символів та кількостей їх входжень
        mx, mc = max([(s.count(c), c) for c in s])
    return mc, mx


s = input("введіть рядок: ")

c, n = max_char(s)

print("Символ - '{}', кількість входжень - {}".format(c, n))
    




