#T12_01
#Стиснення текстового файлу шляхом видалення зайвих пропусків між словами
#та на початку і в кінці рядків

inname = input("введіть ім'я файлу: ")
x=inname.split('.')
#побудова імені результуючого файлу за ім'ям вхідного файлу
#перед останньою крапкою додається _compressed
if len(x) > 1:
    k = -2          #у імені вхідного файлу є крапка та "розширення" імені           
else:
    k = -1          #у імені вхідного файлу немає крапки
x[k] = x[k]+"_compressed"    
outname = '.'.join(x)

#відкриваємо вхідний та результуючий файли
f=open(inname,'r')
g=open(outname,'w')

for line in f:      #перебираємо всі рядки вхідного файлу
    x = line.split()            #будємо список слів, split видаляє також '\n'
    outline = ' '.join(x)+'\n'  #будуємо рядок для запису у файл результату 
    g.write(outline)

#закриваємо вхідний та результуючий файли
f.close()
g.close()

      


