#T20_61
#Визначити значення інтегралу функції на відрізку [a, b].
#Метод трапецій та метод Монте-Карло

import numpy as np

def trap_integral(f, a = 0, b = 1, n = 10000000):
    '''Обчислює значення інтегралу функції f на відрізку [a, b].

    Обчислення проводиться методом трапецій.
    Значення обчислюється для n точок
    '''
    h = (b-a)/n
    x = np.linspace(a, b, n + 1)    #масив x
    y = f(x)                        #масив y
    y[0] /= 2
    y[-1] /= 2
    s = np.sum(y) * h
    return s

def mc_integral(f, a = 0, b = 1, n = 10000000):
    '''Обчислює значення інтегралу функції f на відрізку [a, b].

    Обчислення проводиться методом Монте-Карло.
    Значення обчислюється для n точок
    '''
    h = (b-a)/n
    x = np.random.uniform(a, b, n + 1)  #масив x
    s = np.sum(f(x)) * h
    return s

def fun(x):
    '''x**3-7*x+1.

    '''
    return x**3-7*x+1

a = float(input("Початок відрізку: "))
b = float(input("Кінець відрізку: "))

print('Метод трапецій')
m1 = trap_integral(fun,a,b)
print('Інтеграл функції {}\n на відрізку [{},{}]={}'.format(fun.__doc__ ,a,b,m1))

print('\nМетод Монте-Карло')
m2 = mc_integral(fun,a,b)
print('Інтеграл функції {}\n на відрізку [{},{}]={}'.format(fun.__doc__ ,a,b,m2))

