# t04_05_fuct3num_v2.py
# Дано натуральне число n.
# Скласти програму, яка з`ясовує, чи є серед натуральних чисел m <= n такі,
# для яких можна подати m! у вигляді добутку трьох послідовних чисел.

n = int(input('n=? '))

p = 1
for m in range(1, n + 1):
    # Обчислюємо m!
    p *= m

    # Перевіряємо, чи можно представити p = k*(k-1)*(k-2)
    if m >= 3:
        k = int(p ** (1 / 3))
        while (k - 1) * k * (k + 1) < p:
            k += 1

        if (k - 1) * k * (k + 1) == p:
            print(m, '!=', p, '=', (k - 1), '*', k, '*', k + 1)
