# t04_05_fuct3num_v1.py
# Дано натуральне число n.
# Скласти програму, яка з`ясовує, чи є серед натуральних чисел m <= n такі,
# для яких можна подати m! у вигляді добутку трьох послідовних чисел.

n = int(input('n=? '))

for m in range(1, n + 1):
    # Обчислюємо m!
    p = 1
    for i in range(1, m + 1):
        p *= i

    # Перевіряємо, чи можно представити p = k*(k-1)*(k-2)
    if m >= 3:
        k = m
        while k * (k - 1) * (k - 2) < p:
            k += 1

        if k * (k - 1) * (k - 2) == p:
            print(m, '!=', p, '=', k - 2, '*', k - 1, '*', k)
