#T05_21
#Замінити у даному рядку всі входження другого рядка третім рядком

s=input('рядок: ')
c=input('підрядок, якій замінювати: ')
s1=input('рядок заміни: ')

ls=len(s)
lc=len(c)
if lc == 0:                     #якщо підрядок, що треба замінити порожній
    r=s
else:
    r=""
    i=0
    while i < ls:
        if s[i:i+lc] == c:      #якщо підрядок s починаючи з символа i
                                #довжиною lc дорівнює c
            r += s1
            i += lc
        else:
            r += s[i]
            i += 1

print('результат: ',r)
