#T06_31_v2
#Видалення з рядка усіх повторних входжень слів
#та виведення всіх різних слів рядка у алфавітному порядку

s = input("введіть рядок: ")

x = s.split()   #x - список усіх слів рядка s
#a - список слів без повторів - будуємо за допомогою спискоутворення
#та функції enumerate
a = [w for i,w in enumerate(x) if x.index(w) == i]

s1 = ' '.join(a)    #будуємо рядок s1 з списку слів a
print('рядок пісдя видалення повторних входжень\n',s1)

a.sort()            #впорядковуємо список слів a за алфавітом  
s2 = '\n'.join(a)   #будуємо рядок s2 з впорядкованого списку слів a
print('слова в алфавітному порядку\n',s2)



